Reports/ЛБ_РасхожденияСLX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_РасхожденияСLX</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиБУ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроцентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОсновномуДолгу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_РасхожденияСLX/Ext/ObjectModule.bsl
функция OpenRs_(ТекстSQL,CATALOG)
	Если CATALOG тогда
		Подключение ="Provider=SQLOLEDB.1;data PROVIDER=SQLOLEDB.1;PASSWORD=123456;PERSIST SECURITY INFO=TRUE;USER ID=elix;INITIAL CATALOG=dlink;DATA SOURCE=192.168.0.244";
	Иначе
		Подключение ="Provider=SQLOLEDB.1;data PROVIDER=SQLOLEDB.1;PASSWORD=123456;PERSIST SECURITY INFO=TRUE;USER ID=elix;INITIAL CATALOG=dcbdl;DATA SOURCE=192.168.0.244";	
	КонецЕсли;
	СоединениеSQL = Новый COMObject("ADODB.Connection");
	СоединениеSQL.ConnectionString = Подключение;
	СоединениеSQL.Open();
	СоединениеSQL.commandTimeout=600;
	ЗаписиSQL = Новый COMObject("ADODB.Recordset");
	ЗаписиSQL.CursorLocation = 3;
	ЗаписиSQL.Open (ТекстSQL, СоединениеSQL,,3) ;
	возврат  ЗаписиSQL;
конецфункции

Процедура УдалитьЗБСоСтатусом(стрСтатус, тзСтатусов, тз)
	
	отб1 = Новый Структура("СтатусLX", стрСтатус);
	ЗБОтгр = тзСтатусов.НайтиСтроки(отб1);  
	МассивЗБ = Новый Массив;
	Для каждого элЗБОтгр из ЗБОтгр Цикл	
		СтруктураОтбора = Новый Структура("НомерЗБ", элЗБОтгр.НомерЗБ);
		МассивСтрок = тз.НайтиСтроки(СтруктураОтбора);
		Для Каждого ЭлементМассив Из МассивСтрок Цикл
			тз.Удалить(ЭлементМассив); 
		КонецЦикла;
	КонецЦикла;   
	
КонецПроцедуры



Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	
	pndoc = "";
	pplat = "";
	
	//Если ЗначениеЗаполнено(Ломбард) Тогда
	//	промЛ = СокрЛП(Ломбард);
	//	позН  = СтрНайти(промЛ, "№");
	//	pplat = Сред(промЛ, позН+2);
	//КонецЕсли;
	
	//db = "'" + pDb + "'";
	de = "'" + НаДату + "'";
	
	тз = Новый ТаблицаЗначений;
	тз.Колонки.Добавить("НомерЗБ");
	тз.Колонки.Добавить("ДатаДок");
	тз.Колонки.Добавить("ЛомбардСтр");
	тз.Колонки.Добавить("nObj");
	тз.Колонки.Добавить("Ломбард");  
	тз.Колонки.Добавить("StatTo"); 
	тз.Колонки.Добавить("СтатусLX"); 

	тз.Колонки.Добавить("Тело_LX",     	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Тело_1С",  	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Тело_Разница", Новый ОписаниеТипов("Число")); 
	
	тз.Колонки.Добавить("Проценты_LX", 	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Проценты_1с",  Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("Проценты_Разница", Новый ОписаниеТипов("Число")); 
	
	тз.Колонки.Добавить("ПСК_LX",     	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("ПСК_1С",	 	Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("ПСК_Разница", 	Новый ОписаниеТипов("Число"));

	         
	
	ТекстSQL  = "select * FROM Zazb_ostproc_axi  where dproc = " + de;
	Если ЗначениеЗаполнено(Ломбард) Тогда
		ТекстSQL = ТекстSQL +" and nobj = '"+СокрЛП(Ломбард.id_LX)+"'";			
	КонецЕсли;
	//Если ЗначениеЗаполнено(ЗБ) Тогда
	//	ТекстSQL = ТекстSQL +" and nomer = '"+ЗБ+"'";			
	//КонецЕсли;
	
 
	rt = OpenRs_(ТекстSQL,Ложь);
	СоответствияСтатусов = ЛБ_ОбщегоНазначения.СоответствиеСтатусовLXи1С();

	Пока не rt.eof() цикл
		Если не rt.eof() Тогда 
			Попытка
			НовСтр = тз.Добавить();
			НовСтр.НомерЗБ         = rt.fields("Nomer").value;
			НовСтр.StatTo          = rt.fields("StatTo").value;
			НовСтр.СтатусLX        = СоответствияСтатусов.Получить(СокрЛП(НовСтр.StatTo));
			НовСтр.nObj            = rt.fields("nObj").value;
			НовСтр.ЛомбардСтр      = rt.fields("PLAT").value;  			
			НовСтр.Тело_LX        	   = Окр(rt.fields("sKred").value,2);
			НовСтр.Проценты_LX       = Окр(rt.fields("sProc").value,2);
			
			НовСтр.Ломбард    = ЛБ_ОбменLX.ВернутьЛомбардПоID(СокрЛП(НовСтр.nObj));

		Исключение
			Сообщить("Не смог загрузить: "+rt.fields("Nomer").value);
		КонецПопытки;
			
			rt.movenext();	
		КонецЕсли;
	КонецЦикла; 
		
		
	тз.Индексы.Добавить("НомерЗБ"); 
	
	тзСтатусов = тз.Скопировать(, "НомерЗБ,СтатусLX");

		
	тзСтат = тз.Скопировать();


		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЛБ_РасчетыСКлиентамиОстатки.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоОсновномуДолгу)
	               |			ТОГДА ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток
	               |	КОНЕЦ КАК Тело_1С,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.НомерЗалоговогоБилета КАК НомерЗБ,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Ломбард КАК Ломбард,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Дата КАК ДатаДок,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.СуммаСсуды) КАК СуммаСсуды,
	               |	СУММА(ЕСТЬNULL(ВложенныйЗапрос.СуммаПроцентов, 0)) КАК СуммаПроцентовНач,
	               |	0 КАК Проценты_1с
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&НаДату,
	               |			ИСТИНА
	               |				И 100 = 100
	               |				И 200 = 200) КАК ЛБ_РасчетыСКлиентамиОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_ОперацияПоЗалогуГрафикПлатежей.СуммаПроцентов КАК СуммаПроцентов,
	               |			ЛБ_ОперацияПоЗалогуГрафикПлатежей.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.ЛБ_ОперацияПоЗалогу.ГрафикПлатежей КАК ЛБ_ОперацияПоЗалогуГрафикПлатежей) КАК ВложенныйЗапрос
	               |		ПО ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет = ВложенныйЗапрос.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЛБ_РасчетыСКлиентамиБУОстатки.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |			ЛБ_РасчетыСКлиентамиБУОстатки.СуммаОстаток КАК СуммаОстаток
	               |		ИЗ
	               |			РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.Остатки(&НаДату, ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиБУОстатки) КАК ВложенныйЗапрос1
	               |		ПО ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет = ВложенныйЗапрос1.ЗалоговыйБилет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.НомерЗалоговогоБилета,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.ДатаВыкупа,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Ломбард,
	               |	ЛБ_РасчетыСКлиентамиОстатки.ЗалоговыйБилет.Дата,
	               |	ВЫБОР
	               |		КОГДА ЛБ_РасчетыСКлиентамиОстатки.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоОсновномуДолгу)
	               |			ТОГДА ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток
	               |	КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	ЛБ_РасчетыСКлиентамиБУОстатки.ЗалоговыйБилет.НомерЗалоговогоБилета,
	               |	ЛБ_РасчетыСКлиентамиБУОстатки.Ломбард,
	               |	NULL,
	               |	NULL,
	               |	0,
	               |	0,
	               |	ЛБ_РасчетыСКлиентамиБУОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ.Остатки(
	               |			&НаДату,
	               |			ВидРасчета = &ВидРасчета
	               |				И 100 = 100
	               |				И 200 = 200) КАК ЛБ_РасчетыСКлиентамиБУОстатки"; 
	
	Граница = Новый Граница(КонецДня(НаДату), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("НаДату",     Граница); 
	Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);	
	//Если ЗначениеЗаполнено(ЗБ) Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "100 = 100", "ЗалоговыйБилет.НомерЗалоговогоБилета = &ЗБ");
	//	Запрос.УстановитьПараметр("ЗБ", ЗБ);
	//КонецЕсли;
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "200 = 200", "ЗалоговыйБилет.Ломбард = &Ломбард");
		Запрос.УстановитьПараметр("Ломбард", Ломбард);
	КонецЕсли;
	
	
	тз1С = Запрос.Выполнить().Выгрузить(); 
	тз1С.Колонки.Добавить("ПСК_1С",	 	Новый ОписаниеТипов("Число"));
	
		
	Для каждого стр из тз1С Цикл
		НовСтр = тз.Добавить();	
		
//		СрокРасчета = (стр.ДатаВыкупа - НачалоДня(стр.ДатаДок))/(24*60*60);
//	    Стр.ПСК_1С = Окр(ЛБ_УправлениеЛомбардом.РасчетПСКГод(СрокРасчета, стр.СуммаСсуды, стр.СуммаПроцентовНач),3);
       		
		ЗаполнитьЗначенияСвойств(НовСтр, стр);	
	КонецЦикла; 
	
	тз.Свернуть("Ломбард, НомерЗБ", "Тело_LX, Тело_1С, Проценты_LX, Проценты_1С, Тело_Разница, Проценты_Разница, ПСК_LX, ПСК_1С, ПСК_Разница");
	
	УдалитьЗБСоСтатусом("Отгружен", тзСтатусов, тз); 
	УдалитьЗБСоСтатусом("Объявл.Торг", тзСтатусов, тз);  


	
	тзДляСт = тз.Скопировать(,"НомерЗБ"); 
	СтрокаНомеров = "(";
	КолСтроч = тзДляСт.Количество();
	
	ном = 0;
	Для каждого стр из тзДляСт Цикл
		ном = Ном + 1;
		Если ном = КолСтроч Тогда
			СтрокаНомеров = СтрокаНомеров+СокрЛП(стр.НомерЗБ)+")";
		Иначе
			СтрокаНомеров = СтрокаНомеров+СокрЛП(стр.НомерЗБ)+",";
		КонецЕсли;
	КонецЦикла;
	
	
	ТекстSQL  = "select stat,nomer from azb where nomer in " + СтрокаНомеров;
	
	тзСтатусов = Новый ТаблицаЗначений;
	тзСтатусов.Колонки.Добавить("НомерЗБ");
	тзСтатусов.Колонки.Добавить("Статус"); 
	тзСтатусов.Колонки.Добавить("СтатусЧисло"); 
	
	rt = OpenRs_(ТекстSQL,Ложь);	
	Пока не rt.eof() цикл
		Если не rt.eof() Тогда 
			НовСтроч = тзСтатусов.Добавить();
			НовСтроч.НомерЗБ = rt.fields("nomer").value; 
			НовСтроч.СтатусЧисло = rt.fields("Stat").value; 
			НовСтроч.Статус        = СоответствияСтатусов.Получить(СокрЛП(rt.fields("Stat").value));
			
			rt.movenext();	
		КонецЕсли;
	КонецЦикла; 
	
	тзСтатусов.Индексы.Добавить("НомерЗБ");	
	
	тз.Колонки.Добавить("СтатусLX"); 
	тз.Колонки.Добавить("Статус1С");
	тз.Колонки.Добавить("СтатусЧисло");
	Для каждого стр из тз Цикл
		стр.Тело_Разница = стр.Тело_LX - стр.Тело_1С;
		стр.Проценты_Разница = стр.Проценты_LX - стр.Проценты_1С;
		стр.ПСК_Разница = стр.ПСК_LX - стр.ПСК_1С;
		НайдСт =  тзСтатусов.Найти(стр.НомерЗБ, "НомерЗБ");
		Если НайдСт <> неопределено Тогда
			стр.СтатусLX = НайдСт.Статус; 
			стр.СтатусЧисло = НайдСт.СтатусЧисло;

		КонецЕсли;		
	КонецЦикла;
	

	
	
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
	// - Если сделать так, как показано выше(рекомендуют на некоторых ресурсах), то при изменении настроек в режиме клиента
	// этих изменений Вы не увидите, потому что настройки всегда будут по умолчанию. Как правильно - вариант ниже
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ТЗ", ТЗ); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
